2-SQL/03-Active-Record/URL_shortener/URLShortener/app/models/shortened_url.rb

    def self.create_short_url_for_user!(user, long_url)
        ShortenedUrl.create!(
            user_id: user.id,
            long_url: long_url,
            short_url: ShortenedUrl.random_code
        )
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def self.random_code
        out = SecureRandom.urlsafe_base64

        while ShortenedUrl.exists?(:short_url => out)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "BiZXhiXI8nZS8GXx7KcS5Q"], ["LIMIT", 1]]