2-SQL/03-Active-Record/URL_shortener/URLShortener/app/models/visit.rb

    def self.record_visit!(user, shortened_url)
        Visit.create!(user_id: user.id, short_url_id: shortened_url.id)
---
INSERT INTO "visits" ("user_id", "short_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["short_url_id", 4], ["created_at", "2021-02-24 01:37:52.593220"], ["updated_at", "2021-02-24 01:37:52.593220"]]