3-Rails/first-routes-controllers/first_routes_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        if params[:query]
            users = User.where('username LIKE ?', "%#{params[:query]}%")
        else
            users = User.all

INSERT INTO "users" ("created_at", "updated_at", "name", "email") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2021-06-24 01:09:27.470777"], ["updated_at", "2021-06-24 01:09:27.470777"], ["name", "Toby"], ["email", "cat@cats.com"]]
---
    def create
        user = User.new(user_params)
        if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "username" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-08-14 18:29:10.771859"], ["username", "willem dafoe"], ["id", 35]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_params) #update_attributes is deprecated